; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	satellite3 - satellite
	instrument8 - instrument
	infrared1 - mode
	thermograph3 - mode
	infrared0 - mode
	image2 - mode
	Star7 - direction
	Star4 - direction
	Star0 - direction
	GroundStation9 - direction
	Star6 - direction
	Star3 - direction
	Star2 - direction
	GroundStation1 - direction
	GroundStation8 - direction
	Star5 - direction
	Star10 - direction
	Phenomenon11 - direction
	Star12 - direction
	Phenomenon13 - direction
)
(:init
	(supports instrument0 image2)
	(supports instrument0 thermograph3)
	(calibration_target instrument0 GroundStation8)
	(supports instrument1 thermograph3)
	(calibration_target instrument1 Star0)
	(calibration_target instrument1 Star4)
	(supports instrument2 infrared1)
	(calibration_target instrument2 GroundStation9)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star5)
	(supports instrument3 image2)
	(supports instrument3 thermograph3)
	(supports instrument3 infrared0)
	(calibration_target instrument3 GroundStation9)
	(calibration_target instrument3 Star6)
	(calibration_target instrument3 Star5)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star7)
	(supports instrument4 thermograph3)
	(supports instrument4 image2)
	(calibration_target instrument4 Star3)
	(calibration_target instrument4 Star6)
	(calibration_target instrument4 GroundStation1)
	(supports instrument5 image2)
	(calibration_target instrument5 Star3)
	(calibration_target instrument5 Star6)
	(calibration_target instrument5 GroundStation8)
	(supports instrument6 infrared0)
	(supports instrument6 image2)
	(calibration_target instrument6 GroundStation8)
	(supports instrument7 image2)
	(calibration_target instrument7 GroundStation8)
	(calibration_target instrument7 Star2)
	(calibration_target instrument7 GroundStation1)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star5)
	(supports instrument8 image2)
	(supports instrument8 infrared0)
	(supports instrument8 thermograph3)
	(calibration_target instrument8 Star5)
	(calibration_target instrument8 GroundStation8)
	(calibration_target instrument8 GroundStation1)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation8)
)
(:goal (and
	(pointing satellite0 GroundStation1)
	(pointing satellite1 Star12)
	(have_image Star10 thermograph3)
	(have_image Phenomenon11 infrared0)
	(have_image Star12 thermograph3)
	(have_image Phenomenon13 thermograph3)
))

)

; plan
1. (turn_to satellite1 groundstation9 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 groundstation9)
   goals met: 0 of 6
2. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 6
3. (calibrate satellite1 instrument3 groundstation9)
   added: (calibrated instrument3)
   goals met: 0 of 6
4. (turn_to satellite1 phenomenon13 groundstation9)
   deleted: (pointing satellite1 groundstation9)
   added: (pointing satellite1 phenomenon13)
   goals met: 0 of 6
5. (take_image satellite1 phenomenon13 instrument3 thermograph3)
   added: (have_image phenomenon13 thermograph3)
   goals met: 1 of 6
6. (turn_to satellite1 phenomenon11 phenomenon13)
   deleted: (pointing satellite1 phenomenon13)
   added: (pointing satellite1 phenomenon11)
   goals met: 1 of 6
7. (turn_to satellite0 groundstation1 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 groundstation1)
   goals met: 2 of 6
8. (take_image satellite1 phenomenon11 instrument3 infrared0)
   added: (have_image phenomenon11 infrared0)
   goals met: 3 of 6
9. (turn_to satellite1 star10 phenomenon11)
   deleted: (pointing satellite1 phenomenon11)
   added: (pointing satellite1 star10)
   goals met: 3 of 6
10. (take_image satellite1 star10 instrument3 thermograph3)
   added: (have_image star10 thermograph3)
   goals met: 4 of 6
11. (turn_to satellite1 star12 star10)
   deleted: (pointing satellite1 star10)
   added: (pointing satellite1 star12)
   goals met: 5 of 6
12. (take_image satellite1 star12 instrument3 thermograph3)
   added: (have_image star12 thermograph3)
   goals met: 6 of 6
